{"id":34331,"date":"2022-10-21T12:23:54","date_gmt":"2022-10-21T12:23:54","guid":{"rendered":"https:\/\/nextgen.seamfix.com\/?p=34331"},"modified":"2022-10-28T06:59:08","modified_gmt":"2022-10-28T06:59:08","slug":"tech-talents-are-in-demand-you-can-become-one","status":"publish","type":"post","link":"https:\/\/nextgen.seamfix.com\/tech-talents-are-in-demand-you-can-become-one\/","title":{"rendered":"Tech Talents are in Demand, Here&#8217;s How To Become One!"},"content":{"rendered":"\r\n<p><em>By: Chilotam Ojukwu on <\/em><em>21st October, 2022<\/em><\/p>\r\n\r\n\r\n\r\n<p>My African parents will never understand why, as a remote worker, I have to be on my laptop, phone, monitor and in certain work meetings for basically half of the day.<br \/><br \/>“Every time, you are <em>in front of laptop<\/em>”, says my mum every single day, despite how much I have attempted to explain the nature of my job to her, and that I am required to be “<em>in front of laptop<\/em>” during working hours. She still doesn’t get it though.<\/p>\r\n\r\n\r\n\r\n<p>Here’s the thing about jobs &#8211; they vary. From teaching, to being a banking consultant, to being a hairstylist, to being a caretaker, a doctor, and even a full time mum. However, the nature of my own job is &#8211; as the cool kids call it, “tech”. And like every other job, it requires a good level of commitment.<\/p>\r\n\r\n\r\n\r\n<p>Food for thought, tech is not only limited to the popular career paths we know and hear about such as Product Design, Software Engineering, Writing Codes, Front and Back End Development, etc. It encompasses many other roles and carrer paths. You could be a tech lawyer, or a tech writer, or even a journalist for tech companies. There’s so much to do out there.<\/p>\r\n\r\n\r\n\r\n<p>Tech is like the new oil in Nigeria. A couple of years ago, being in the oil and gas industry meant you were a big man or woman, making good money. Now, the “good money” comes from tech, and this is not to negate other sources of income that have been proven to be profitable. <\/p>\r\n\r\n\r\n\r\n<p>In terms of having a white collar job, many people are migrating to this part of the industry, by learning a tech skill or two and becoming one of the hottest cakes in town &#8211; in terms of their skills. I’m pretty sure that this has crossed your mind as well, and you’re not wrong for that. In fact, let me peak your interest and curiosity even more.<\/p>\r\n\r\n\r\n\r\n<p>As someone who intends to get into the tech industry but doesn’t have much experience, knowledge or even the slightest idea of <em>what<\/em> it is or <em>how<\/em> to begin, I have interesting news for you. The   FlexceeTech  Next Gen Academy is a program that is designed to equip individuals that intend to break into the tech industry, with the right skills. It’s everything and more, and the good news is that you don’t have to break the bank to get started, you learn soft skills alongside the technical skills that are taught and you get to start from scratch, as a newbie.<\/p>\r\n\r\n\r\n\r\n<p>What are these “skills” I keep mentioning? The Next Gen Academy is committed to teaching Product Design, Front End Development and Back End Development to those who are interested in learning these skills. You can become one of those “<em>tech bros and sises<\/em>” that we hear so much about.<\/p>\r\n\r\n\r\n\r\n<p>So, who is this open to? I’ll be honest with you, it’s open to those who have the time for it. The program runs for 6 months, after which you will be certified and have a window to begin your journey in tech. What’s the catch? The catch is that you will be taught by experienced experts in their fields who have a ton of knowledge to share, work on real life projects, learn with fellow students in the program &#8211; so you’re not alone, and have enough time to grow, ask questions, make mistakes and learn from them. <\/p>\r\n\r\n\r\n\r\n<p>Let me address the other question that comes to your mind &#8211; “how much do I have to pay?”<\/p>\r\n\r\n\r\n\r\n<p>The program fee is N150,000. Before you think anything, just hold that thought. If you can’t afford to make an upfront payment, you have the option to pay in instalments, with N60,000 every month for 3 months. I think that’s fair enough, no?<\/p>\r\n\r\n\r\n\r\n<p>You and I know that this concept is a good one, so why wait? Visit <a href=\"https:\/\/nextgen.seamfix.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" data-type=\"URL\" data-id=\"https:\/\/nextgen.seamfix.com\/\">here<\/a> to register and get started. You can also contact us at <a href=\"mailto:Help@flexceetech.com\">Help@flexceetech.com<\/a> if you would like to make further enquiries.  Share this good news with your family members and friends who might be interested. You never know who needs this soap you’re about to cut, <em>lol<\/em>.<\/p>\r\n\r\n\r\n\r\n<p>There’s so much more that I have to tell you about the Next Gen Program, so please stick around for the next read with more information and I’ll catch you later!&#x1f440;<\/p>\r\n\n\n","protected":false},"excerpt":{"rendered":"<p>By: Chilotam Ojukwu on 21st October, 2022 My African parents will never understand why, as a remote worker, I have [&hellip;]<\/p>\n","protected":false},"author":438,"featured_media":34332,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[18,22,19,20,21,16,17],"_links":{"self":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts\/34331"}],"collection":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/users\/438"}],"replies":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/comments?post=34331"}],"version-history":[{"count":0,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts\/34331\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/media\/34332"}],"wp:attachment":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/media?parent=34331"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/categories?post=34331"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/tags?post=34331"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}