{"id":34648,"date":"2022-11-14T12:51:44","date_gmt":"2022-11-14T12:51:44","guid":{"rendered":"https:\/\/nextgen.seamfix.com\/?p=34648"},"modified":"2022-11-14T21:14:38","modified_gmt":"2022-11-14T21:14:38","slug":"blog-the-struggles-of-nysc-getting-skills-for-employment","status":"publish","type":"post","link":"https:\/\/nextgen.seamfix.com\/blog-the-struggles-of-nysc-getting-skills-for-employment\/","title":{"rendered":"The Struggles of NYSC: Employment After Serving Nigeria"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">By: Chilotam Ojukwu<\/span><\/em><\/p>\n<p><em><span style=\"font-weight: 400;\">Published: 13th November, 2022<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">I can guarantee you that every Nigerian who has served Nigeria through the NYSC program, understands and has faced the struggles and hardships of serving. NYSC stands for National Youth Service Corps. It is a 1 year program that was designed by <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Yakubu_Gowon\"><span style=\"font-weight: 400;\">Yakubu Gowon<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Adebayo_Adedeji\"><span style=\"font-weight: 400;\">Adebayo Adedeji<\/span><\/a><span style=\"font-weight: 400;\">, to foster national unity amongst Nigerian youths. This is because Nigeria is a large country with many ethnic groups and languages. NYSC was created so that Nigerian youths would be more familiar with the different parts of the country. It is usually done after graduation from the university.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Nigerians in this program are called “Corpers” or “Corps Members”. Corpers are posted to a state &#8211; usually different from where they are from, where they grew up and\/or went to school &#8211; to work in companies such as schools, tech companies, government institutions and so much more. Through NYSC, they can get acquainted with the culture of other parts of Nigeria and even make new friends. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In Nigeria, the unemployment rate is at an all time high, peaking 33% and will most likely increase by 2023. There are many sides to this problem, but two common ones are; <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Young people &amp; fresh graduates not being equipped with the right skill sets to gain employment.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Companies having a hard time hiring qualified candidates for different roles. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The period after graduation from school and conclusion with NYSC is laced with so much uncertainty that could drive young people into a potential state of depression. Those who wish to learn on the job and gain certain skills are not able to, because of  “limited resources and opportunities”. Another problem is how companies may not have the bandwidth to properly train and build young people up for the positions that need to be filled. It’s a whole mess with so many nuances and understandable perspectives. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s the thing, you don’t need to be in a state of uncertainty after NYSC or university graduation, because there is so much to learn that can set you apart from your peers in terms of technical skills. One of the important things to note when it comes to seeking employment is <\/span><b>skill<\/b><span style=\"font-weight: 400;\">s. What can you do? What sets you apart? How well do you know your onions? What do you need to make it happen? How open are you to improving and finding better ways to get things done? What <\/span><i><span style=\"font-weight: 400;\">have<\/span><\/i><span style=\"font-weight: 400;\"> you done? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Skills are so essential for your growth and success as an individual in the labour market. Technical skills show your level of expertise and soft skills distinguish you from your competitors on a more personal level. Luckily for you, I have compiled 3 ways that you can begin a career with technical skills if you are new to the job market. Even if you have no idea how to go about acquiring these skills, these tips will help you have a head start, especially in Tech. Here are a few ways that you can build up your portfolio with relevant experiences in the tech role that you wish to get into:<\/span><br \/>\n<b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Internships<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Internships are a great way to start as a rookie in tech because you can gain granular knowledge about the industry you want to work in at a more comfortable pace. If for instance, you’d like to be a Front End Engineer or Developer, your best bet is to apply for internships as a Front End Engineer or Developer in tech companies. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A couple of things are involved here such as proximity to your home, convenience and how much you are actually learning. In the end, there is one goal; to have experience and learn directly from professionals. You also learn soft skills, because you get to work with different people from various backgrounds. <\/span><b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Training<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Getting trained in the ins and outs of a specialty that you would like to work in may also require you to pay for it. In this setting, online courses are your best bet because there are several affordable courses for beginners who want to break into a career path that they know little about. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The cost of paying often scares people away, but what’s the bigger picture here? The bigger picture is the fact that NYSC is borderline frustrating, and that you want to get a good job. Besides, if you can afford to pay for internet services every other week, you can definitely save up for one or two online courses. Keep in mind that a good laptop plays an important role in your learning experience here, so definitely consider this.<\/span><b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Registering For an Academy<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">An academy is one of the best ways to kickstart your career in a designated field. Thankfully, there are numerous online and onsite academies that offer to train graduates with the technical skills that they need to excel in the job market.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">An academy can also provide you with more exposure and hands-on experience with the day-to-day operations of the learning path that you are on. In about 6 months to 1 year, you’re already ahead of your peers. You also have a competitive advantage when seeking employment. The best part is that it could be flexible enough to allow you honour your other commitments while improving yourself. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s the good news. You can get all of these &#8211; aforementioned techniques &#8211; in one “package” that has one goal alone; to help you become one of the in-demand tech talents in the job market. The <\/span><a href=\"https:\/\/nextgen.seamfix.com\/\"><span style=\"font-weight: 400;\">NextGen Academy<\/span><\/a><span style=\"font-weight: 400;\"> has curated a 6 month program that trains you in one of the following areas;<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Front End Development<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Back End Development<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Product Design<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">It’s all up to you to choose which suits your intended career path best. Instead of basking in uncertainties after university and NYSC, you can utilise 6 months in a year to build yourself and get better at your craft. The academy grants you a certificate of completion upon your graduation and also links you to the best tech communities to learn from. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You get to be with a tribe of like minds and amazing colleagues who will be a part of your journey and growth. It only gets better from there. Find the details below to <\/span><a href=\"https:\/\/nextgen.seamfix.com\/\"><span style=\"font-weight: 400;\">register<\/span><\/a><span style=\"font-weight: 400;\"> for the academy:<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Price &#8211; N200,000 ($250) or N80,000 ($100) monthly for 3 months<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">Registration Ends on January 21st 2023<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">Follow our social media to keep up with us and you can contact us at <\/span><a href=\"mailto:Help@flexceetech.com\"><span style=\"font-weight: 400;\">Help@flexceetech.com<\/span><\/a><span style=\"font-weight: 400;\"> if you need to make more enquiries.<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>By: Chilotam Ojukwu Published: 13th November, 2022 I can guarantee you that every Nigerian who has served Nigeria through the [&hellip;]<\/p>\n","protected":false},"author":438,"featured_media":34649,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[43,44,42,45],"_links":{"self":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts\/34648"}],"collection":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/users\/438"}],"replies":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/comments?post=34648"}],"version-history":[{"count":0,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts\/34648\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/media\/34649"}],"wp:attachment":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/media?parent=34648"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/categories?post=34648"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/tags?post=34648"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}