{"id":34681,"date":"2022-11-15T21:24:37","date_gmt":"2022-11-15T21:24:37","guid":{"rendered":"https:\/\/nextgen.seamfix.com\/?p=34681"},"modified":"2022-11-18T13:02:16","modified_gmt":"2022-11-18T13:02:16","slug":"switching-careers-to-it-a-how-to-guide","status":"publish","type":"post","link":"https:\/\/nextgen.seamfix.com\/switching-careers-to-it-a-how-to-guide\/","title":{"rendered":"Switching Careers to IT: A How-To Guide"},"content":{"rendered":"<p><i><span style=\"font-weight: 400;\">By: Chilotam Ojukwu<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">Published: 15th November, 2022<\/span><\/i><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">There is an African proverb that says; “The sky is vast enough for all birds to fly without collisions”. This directly translates to; there is enough space and opportunity for every person to succeed, without hindering the success of another. And this is very accurate.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">One misconstrued fact about getting into a more technical role &#8211; such as product designing, software engineering and the likes &#8211; is that it is only for a select few. This is wrong. Often, people may doubt their abilities to thrive in a technical environment because of the gatekeeping that comes with certain territories. <\/span><a href=\"https:\/\/medium.com\/@damngoodtech\/how-to-recognize-tech-gatekeeping-and-how-to-ignore-it-or-stop-it-b1c72493f391\"><span style=\"font-weight: 400;\">Gatekeeping<\/span><\/a><span style=\"font-weight: 400;\"> is <\/span><span style=\"font-weight: 400;\">the activity of controlling, and usually limiting, general access to something. In this case, certain individuals may gate-keep tech in general, by limiting people’s access to the industry.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The good news is that &#8211; once again &#8211; the sky is vast enough for all birds to fly without collisions. Now, what <\/span><i><span style=\"font-weight: 400;\">is<\/span><\/i><span style=\"font-weight: 400;\"> a technical role? What <\/span><i><span style=\"font-weight: 400;\">is<\/span><\/i><span style=\"font-weight: 400;\"> a non-technical role? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A <\/span><a href=\"https:\/\/www.lawinsider.com\/dictionary\/technical-position#:~:text=Related%20Definitions&amp;text=Technical%20position%20means%20a%20position,on%2Dthe%2Djob%20training.\"><span style=\"font-weight: 400;\">technical role<\/span><\/a><span style=\"font-weight: 400;\"> is one that requires you to have specialised knowledge in a particular field, to perform expertise functions. The roles could be junior, intermediate or senior, where you serve as a professional in your domain. A technical role or position requires a combination of skills that may be obtained through years of experience in that domain. It can also be acquired by on-the-job training. <\/span><a href=\"https:\/\/www.indeed.com\/career-advice\/resumes-cover-letters\/technical-skills\"><span style=\"font-weight: 400;\">Examples<\/span><\/a><span style=\"font-weight: 400;\"> of technical roles that can be learnt on the job are; Technical Writing, Data Analysis, Project Management and so much more. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A <\/span><a href=\"https:\/\/www.benjamindada.com\/succeeding-tech-non-technical-person-20-experts\/\"><span style=\"font-weight: 400;\">non-technical role<\/span><\/a><span style=\"font-weight: 400;\"> is one that focuses more on an individual’s communication and analytical skills, rather than their technical knowledge. They also do not require you to have core IT Skills, such as coding, programming and web development. <\/span><a href=\"https:\/\/degreesandcareers.info\/resources\/tech-jobs\/\"><span style=\"font-weight: 400;\">Examples<\/span><\/a><span style=\"font-weight: 400;\"> of non-technical roles (in and out of tech) that can also be learnt on the job are Product Marketing, Digital Marketing, Sales Development, Human Resources and so much more. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The world is gradually becoming more digital and technology has made all our lives easier. This has also made many people reconsider their career choices and even contemplate changing career paths from a non-technical role to a technical role. While this doesn’t apply to every single person in the labour market, more people are being encouraged to get into technical roles, to become a “tech bro” or a “tech sis”. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It can get difficult to navigate through the different technical roles that exist in the job industry, and it’s ok to take some time and figure things out. If you need some direction on the steps to take to make your transition from a non-technical role to a technical one, you’ve come to the right place! Here are some <\/span><a href=\"https:\/\/www.comptia.org\/career-change\/switching-career-path\/how-to\"><span style=\"font-weight: 400;\">things to consider<\/span><\/a><span style=\"font-weight: 400;\"> when transitioning to a technical role:<\/span><\/p>\n<ul>\n<li aria-level=\"1\"><b>Interests<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Interest plays a huge role in what to consider for your means of livelihood. What interests you? What tickles your fancy? What makes you grin from ear to ear when you hear about it? What do you do effortlessly with little to no support? Those are pointers to your interests. The good thing is, your interest in a role enables you to deliver efficiently, even if you’re new to it. For example, I used to work as a Human Resources Executive. A while later, I discovered that my interest was in being a content and copywriter. I eventually transitioned to the latter and I’m happier with my job every single day. I still have a lot to learn, but my interest makes me more curious and willing to be better at it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, if you are interested in certain technical roles such as web development, product design, coding and even programming, you should totally feed into it! How? Start from the basics; reading about them, taking crash courses, taking professional courses, applying them in your day-to-day learnings, joining communities, volunteering in group projects and finally, job hunting. Gathering the necessary skills for your interests gives you a competitive edge over others, especially as a beginner. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fortunately, the internet has so much free information that you can leverage. So, identify your interests and passion, then take it up from there. Of course, this requires you to create time for learning, especially if you have other commitments. The key to all of this is balance.<\/span><b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Monetise Your Passion<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">You don’t particularly have to get into tech to make <\/span><i><span style=\"font-weight: 400;\">cool cash<\/span><\/i><span style=\"font-weight: 400;\"> or transition to something more technical. For example, if you are into videography, photography or even YouTube, more of your skill sets will be lined towards using filming equipment, working light setups and even learning about angles. There is so much that goes into it. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Monetising your passion or interests simply means finding ways to make money or profits from them. On the other hand, if more of your technical skills are IT related, you can monetise them by taking on private projects from clients. You build your network by associating with tech communities, attending tech events and making acquaintances with fellow tech enthusiasts. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As someone who is looking to transition to a technical role career wise, monetising your tech skills can also be attempting to gain employment with a reputable company, to build technological solutions for millions of people to use. Most people have a smartphone and interact with technology daily. You can improve the quality of life of many by being employed as an expert in your area of interest.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s also a win-win. You get to do what you love, monetise it and make life easier for your users. What’s not to love and appreciate about that?<\/span><b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Strive to Improve<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Improvement is a given in every facet of life. Without improvement, civilisation would not have come this far. After identifying your interests and monetising them, the next thing to do is find ways that keep you at the top. Learn new ways to implement and execute tasks, stay on top of trends, keep up with other experts in your field and be active in the communities you join. These are ways to continuously improve your skills. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Challenging yourself with more responsibilities and taking more professional courses &amp; examinations are also great ways to improve your craft. Over time, you realise how much you’ve grown and in the long run, you can pay it forward. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re looking to get into a technical role at work such as coding, programming and the likes, here’s some good news for you; someone has definitely been stuck before. This simply means that all your answers to potential blockers are on the internet. You’re not alone&#x1f609;. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Read more about transitioning into IT Roles <\/span><a href=\"https:\/\/www.comptia.org\/career-change\/switching-career-path\/how-to\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s even more good news for you; if you are looking to transition into a technical career, or if you’re a tech newbie who needs help navigating the tech space, you should register for the <\/span><a href=\"https:\/\/nextgen.seamfix.com\/\"><span style=\"font-weight: 400;\">NextGen Academy<\/span><\/a><span style=\"font-weight: 400;\">. The <\/span><a href=\"https:\/\/nextgen.seamfix.com\/\"><span style=\"font-weight: 400;\">NextGen Academy<\/span><\/a><span style=\"font-weight: 400;\"> is a program that is committed to helping you become one of the best tech talents in the job market. You can acquire a tech skill in <\/span><b>6 months<\/b><span style=\"font-weight: 400;\"> in one of the following programs:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Front End Development<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Back End Development<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Product Design <\/span><\/li>\n<\/ul>\n<p><a href=\"https:\/\/nextgen.seamfix.com\/\"><span style=\"font-weight: 400;\">Register<\/span><\/a><span style=\"font-weight: 400;\"> now to get started with our next cohort in <\/span><b>January 2023<\/b><span style=\"font-weight: 400;\">. The registration ends on <\/span><b>January 21st, 2023<\/b><span style=\"font-weight: 400;\">. After you complete the program, you will be certified in the program of your choice, which gives you a competitive edge over others when applying for jobs. You learn both technical and soft skills at the academy, and connect with professionals in different fields during fireside chat sessions, in tech communities and in groups. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The program fee is <\/span><b>₦200,000<\/b><span style=\"font-weight: 400;\">, however, there is the option to pay in instalments, which is <\/span><b>₦80,000 <\/b><span style=\"font-weight: 400;\">monthly for 3 months. <\/span><a href=\"https:\/\/nextgen.seamfix.com\/\"><span style=\"font-weight: 400;\">Register<\/span><\/a><span style=\"font-weight: 400;\"> now to kickstart your tech career! <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Catch you at the next read!<\/span><\/p>\n\n","protected":false},"excerpt":{"rendered":"<p>By: Chilotam Ojukwu Published: 15th November, 2022 &nbsp; There is an African proverb that says; “The sky is vast enough [&hellip;]<\/p>\n","protected":false},"author":438,"featured_media":34692,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[46,49,48,51,50,47],"_links":{"self":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts\/34681"}],"collection":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/users\/438"}],"replies":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/comments?post=34681"}],"version-history":[{"count":0,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/posts\/34681\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/media\/34692"}],"wp:attachment":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/media?parent=34681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/categories?post=34681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/tags?post=34681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}