{"id":31461,"date":"2022-05-23T08:50:00","date_gmt":"2022-05-23T08:50:00","guid":{"rendered":"https:\/\/nextgen.seamfix.com\/?page_id=31461"},"modified":"2022-05-23T08:50:05","modified_gmt":"2022-05-23T08:50:05","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/nextgen.seamfix.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<p>  FlexceeTech  Limited (“Seamfix”) respects your privacy rights and takes its data protection obligations very seriously. This Privacy Policy sets out our current policies and procedures about how we use your personal data and how we support your rights under data protection law in the UK, Nigeria and internationally. Any personal data that we hold about you will be stored and held securely by us on our computer systems.&nbsp;<\/p>\n\n\n\n<p>Under this Privacy Policy, we shall explain how we receive your information and what we do with such information. We are very committed and transparent in dealing with you and will comply with the applicable data protection legislation, including the Nigerian Data Protection Regulation (“NDPR” 2019), the UK General Data Protection Regulation (“UK GDPR”), the EU General Data Protection Regulation (“EU GDPR”) (whichever is applicable) and the Data Protection Act 2018 (DPA 2018”).&nbsp;<\/p>\n\n\n\n<p>Seamfix’s Privacy Policy applies to personal data, which is supplied by you to   FlexceeTech  by any means whether via this website or application we provide you.&nbsp; In certain circumstances, we may securely share your personal data with third parties and more detail around this can be found elsewhere in our Privacy Policy. The personal data we collect from you is data relevant to the provision of our products or services and will be kept securely and retained as long as is necessary for our contract with you, for our legitimate business purposes or to comply with any legal obligations around retaining data.&nbsp;<\/p>\n\n\n\n<p>It is important that you revisit this Privacy Policy regularly, as we may change the content to reflect how we deliver our products and services. If you have any questions on these policies, kindly contact us at&nbsp;<a href=\"mailto:Help@flexceetech.com\">Help@flexceetech.com<\/a>&nbsp;<\/p>\n\n\n\n<p><strong>The Information we collect and the use of the Information&nbsp;<\/strong><\/p>\n\n\n\n<p>We may collect data, including personal data, about you as you use our Service or request our Service, and otherwise interact with us (‘Your Information’ or “Personal data”). The different ways we collect personal data are through the;<\/p>\n\n\n\n<ul><li>Creation of Account<\/li><li>Support Channels&nbsp;<\/li><li>Information Received from Third Parties<\/li><li>Marketing Information<\/li><li>Payment Processing Information<\/li><li>Device, and Connection Information<\/li><\/ul>\n\n\n\n<p><strong>Lawful bases for processing<\/strong><\/p>\n\n\n\n<p>  FlexceeTech  processes your personal data for different purposes. Data protection law only allows us to use your personal data if we have a lawful reason.&nbsp;When collecting your personal information, we will use it for ascertaining which of our proposed products and\/or services you are interested in. Our lawful basis for this processing may be performance of our contract with you or legitimate interests depending on the processing activity. Where we rely on legitimate interests, we will always balance our rights against yours to make sure the processing does not cause you any detriment.<\/p>\n\n\n\n<p>Where personal data is to be processed because it is necessary for the performance of a contract to which you are a party, we will be unable to provide our services without the required information.<\/p>\n\n\n\n<p><strong>Creation of Account<\/strong><\/p>\n\n\n\n<p>For Individuals who sign up &#8211; we request full name, phone number, email address, contact address, birth certificate, Guarantor Information, Nationally recognized ID card, User usage data<\/p>\n\n\n\n<p>To become a subscriber\/User to the Service you will need to create a personal profile. You can create a profile by registering with the Service and entering your email address, and creating a user name and a password. By registering, you are authorizing us to collect, store and use your email address in accordance with this Privacy Policy<\/p>\n\n\n\n<p>You warrant that you have the authority to provide us with the information you submit to us through this Service. When submitting any of your information, we advise that you put in the correct details of your information as any inaccurate information you submit to us might limit your ability to use our Service or may affect our ability to contact you. When you notice that the information you submit to us is inaccurate, kindly contact us&nbsp;<a href=\"mailto:support@bioregistra.com\">Help@flexceetech.com<\/a>&nbsp;to rectify your data.<\/p>\n\n\n\n<p><strong>Support Channels&nbsp;<\/strong><\/p>\n\n\n\n<p>We collect your personal data when you contact us with inquiries (including by filling out relevant forms on our Service), through our chat box on the Site, respond to one of our surveys, contact our customer success support regarding a problem you are experiencing with the Service, or otherwise contact us regarding the Service.<\/p>\n\n\n\n<p><strong>Payment Processing Information<\/strong><\/p>\n\n\n\n<p>To enable us fulfil your orders, we collect payment and billing information such as debit\/credit card number or your bank account number and a billing representative name and contact information when you register for our Service. We may also receive your financial information (for example, your name, the amount paid and the date of payment) from our third party payment gateway through which we receive payment for the Service.&nbsp;<\/p>\n\n\n\n<p><strong>Information Received From Third Parties<\/strong><\/p>\n\n\n\n<p>We may obtain personal data about you from our authorized resellers, for example, if you purchase access to the Services through one of these partners. The personal data we may receive include business contact information, including mailing addresses, job titles, email addresses, phone numbers.<\/p>\n\n\n\n<p><strong>Marketing Information<\/strong><\/p>\n\n\n\n<p>We may collect your information (such as your name, email address, or other information) if you access any our social media platforms or when you participate in our webinars or events.<\/p>\n\n\n\n<p>We collect and display personal testimonials of satisfied customers and users on the Site in addition to other endorsements. We may post your testimonial, along with your name, on the Site. If you wish to update or delete your testimonial, you can contact us at <a href=\"mailto:support@nextgen.com\">Help@flexceetech.com<\/a>&nbsp;<\/p>\n\n\n\n<p>&nbsp;<strong>What we do with your information<\/strong><\/p>\n\n\n\n<p>We use the information that we collect about you for the following purposes:<\/p>\n\n\n\n<ul><li>To provide you with access to the Service.<\/li><li>To create, operate and maintain your account.<\/li><li>To identify you as a User when you sign in.<\/li><li>To seek your participation in surveys, and to conduct and analyze the results of those surveys if you choose to participate.<\/li><li>To provide you with technical support.<\/li><li>To respond to you about any comment or enquiry you have submitted.<\/li><li>To prevent or take action against activities that are, or maybe, in breach of our Terms of service or applicable law.<\/li><li>For identification and verification purposes.<\/li><li>For marketing, sales and promotional activities.<\/li><li>For product development, to build higher quality and more useful services.<\/li><li>For security purposes and other purposes stated in these policies.<\/li><\/ul>\n\n\n\n<p>We also collect your information to update or rectify your account.&nbsp;&nbsp; The further processing of your information submitted to us is to connect you to payment gateways and other service providers. &nbsp;<\/p>\n\n\n\n<p><strong>Persons Underage<\/strong><\/p>\n\n\n\n<p>Our Terms of Service prohibit use of the Service by any individual below the age of 18 years and we do not knowingly collect personal data from children\/minors.<\/p>\n\n\n\n<p>If you are a parent or guardian and you believe your child is using the Service, please contact us immediately so that we can delete their personal data from our systems.<\/p>\n\n\n\n<p>If we become aware that we have collected personal data from a child\/minor, we will take immediate steps to delete their personal data.<\/p>\n\n\n\n<p><strong>Confidential \/Disclosure of Information<\/strong><\/p>\n\n\n\n<p>The information you provide us will be kept confidential and we shall only disclose such information in accordance with the following;<\/p>\n\n\n\n<p><strong>Service providers, vendors, and contractors (collectively, “Service providers”).<\/strong> We may disclose Your Information to our Service providers that assist us in providing the Service to you. These Service providers are necessary, therefore their access and use of Your Information. Kindly visit their websites for their terms of use as regards the processing of your Personal Information.<\/p>\n\n\n\n<p><strong>Legal Disclosure:<\/strong> Your information may be disclosed to a court or governmental authority to respond to subpoenas, court orders, or other legal processes; to establish or exercise our legal rights, to investigate, prevent or take action regarding illegal or suspected illegal activities or to protect our property; to protect other users, to defend against legal claims; or as otherwise required by law.&nbsp;<\/p>\n\n\n\n<p><strong>Transfer:<\/strong> We also reserve the right to transfer Your Information in the event we sell or transfer all or a portion of our business to a different owner. Where we transfer our rights to a different partner, we will use our best efforts to ensure that the new owner complies with this privacy policy where possible.<\/p>\n\n\n\n<p><strong>Employees, agents, affiliates and representatives:<\/strong> We may disclose Your Information to our employees, agents and affiliates provided that we will take measures to keep the information confidential and abide by this privacy policy.<\/p>\n\n\n\n<p><strong>Marketing Purposes<\/strong><\/p>\n\n\n\n<p>Where you have given your consent to receive marketing from us, we may use your personal details to identify products and services which may be of interest to you, send you newsletters and roadmaps for this service and other notification which enable you to enjoy better Service from us. You can withdraw your consent to receive marketing material by clicking the unsubscribe link on these messages.&nbsp;You also have the ability to opt out at any time from the use of your personal information for direct marketing purposes by sending us a request to <a href=\"mailto:support@nextgen.com\">Help@flexceetech.com<\/a> opt out of direct marketing.<\/p>\n\n\n\n<p><strong>Provision of Security<\/strong><\/p>\n\n\n\n<p>We have put in place the necessary technical and administrative security measures to prevent unauthorized or unlawful access to or accidental loss of or destruction or damage to your information. To ensure the safety of Your Information, we have secured our web services to run within a virtual private connection and an SSL certificate to make sure that all communication is made over HTTPS\/SSL, SFTP using TLS 1.2.&nbsp; The Site is Role-based Access Control (RBAC). Also, Your Passwords are also hashed in the database. All your key information is properly encrypted and secured. However, we do not guarantee 100% security. We shall inform you where we notice any data breach. Be rest assured that Your Information is safe with us as we have qualified and highly trained staff who are specialized in the management of keeping Your Information safe and will always attend to you whenever you encounter problems when accessing our Site.<\/p>\n\n\n\n<p><strong>Rights to Your Information<\/strong><\/p>\n\n\n\n<p>As a User, you have certain rights\/control over the information you submit to us.&nbsp; You have the right;<\/p>\n\n\n\n<ul><li>Request access to your personal data (commonly known as a “Subject Access Request”). This enables you to receive a copy of the personal data we hold about you.<\/li><li>Request rectification of the personal data that we hold about you. This enables you to have any incomplete or inaccurate information we hold about you corrected.<\/li><li>Request erasure of your personal data. This enables you to ask us to delete or remove personal data where there is no good reason for us continuing to process it. You also have the right to ask us to delete or remove your personal data where you have exercised your right to object to processing (see below).<\/li><li>Object to processing of your personal data where we are relying on a legitimate interest (or those of a third party) and there is something about your particular situation which makes you want to object to processing on this ground. If you object to us using your personal data for marketing purposes we will stop sending you marketing material.&nbsp;<\/li><li>Request the restriction of processing of your personal data. This enables you to ask us to suspend the processing of your personal data, for example if you want us to establish its accuracy or the reason for processing it.<\/li><li>Request the transfer of your personal data to another party (data portability).<\/li><li>Automated decision-making. You have the right not to be subject to a decision based solely on automated processing which will significantly affect you. We do not use automated decision-making.&nbsp;&nbsp;<\/li><li>Right to withdraw consent: In the limited circumstances where you may have provided your consent to the processing of your personal data for a specific purpose, you have the right to withdraw your consent for that specific processing at any time. Once we have received notification that you have withdrawn your consent, we will no longer process your information for the purpose or purposes you originally agreed to, unless we are permitted by law.<\/li><\/ul>\n\n\n\n<p><strong>How to exercise your rights<\/strong><\/p>\n\n\n\n<p>If you wish to exercise your rights, please email <a href=\"mailto:support@nextgen.com\">Help@flexceetech.com<\/a>&nbsp;<\/p>\n\n\n\n<p>When you make a request for this policy or as it relates to our Service, please note, you may need to provide us with any necessary information we ask you to confirm your identity. When you make a request to exercise any of the above rights, we shall provide you with your personal information and other necessary information as requested by you. However, we reserve the right to charge you or refuse your request where we notice that your request is repetitive or excessive.&nbsp;Your rights to an erasure of Your Information does not apply to legal necessaries like invoices, audit logs, subscription information, payment, and Your Information archived on our backup systems which we shall securely isolate and protect the use of it from any further processing, to the extent required by applicable law.<\/p>\n\n\n\n<p><strong>Sub-processors<\/strong><\/p>\n\n\n\n<p>To provide you with these services we engage qualified third parties that assist us with different services. For example, we use Paystack for payments services.&nbsp;<\/p>\n\n\n\n<p><strong>Retention of Your Information<\/strong><\/p>\n\n\n\n<p>Your information will be kept online for you to access it easily and will be stored for as long as the purposes for which they were collected apply. We may delete Your Information after 2 years of inactivity from you or completion of the Service to you. Inactivity is the day that marks the end of your last subscription to the service or your last access to the Service. However, we may retain Your Information where there is a need for legal necessaries like invoices, audit logs, subscription information etc. or other purposes stated in a given legislation or regulatory body.&nbsp;<\/p>\n\n\n\n<p><strong>Change in a Privacy Policy<\/strong><\/p>\n\n\n\n<p>When the need arises, we may decide to change this Policy. We may give you notice of such update. However, we advise that you constantly visit the Site, any time you decide to make use of our Service. We will display the last date of which the policy was updated. Your continued use of this Service after the effective date of such changes constitutes your acceptance of such changes.&nbsp;<\/p>\n\n\n\n<p><strong>Cookies Policy<\/strong><\/p>\n\n\n\n<p>For details about how   FlexceeTech  uses cookies and other tracking technologies, please see our&nbsp;Cookies Policy.<\/p>\n\n\n\n<p>(We use cookies to identify you as a User and make your User experience easier, customize our services, content, and advertising; help you ensure that your account security is not compromised, mitigate risk and prevent fraud; and to promote trust and safety on our Site. Cookies allow our servers to remember your account log-in information when you visit our Site, IP addresses, date and time of visits, monitor web traffic and prevent fraudulent activities. If your browser or browser add-on permits, you have the choice to disable cookies on your website, however, this may limit your ability to use our Service.)&nbsp;<\/p>\n\n\n\n<p><strong>Complaints<\/strong><\/p>\n\n\n\n<p>For any privacy-related questions, unresolved problems, or complaints you may contact us at <a href=\"mailto:support@nextgen.com\">Help@flexceetech.com<\/a>&nbsp;<\/p>\n\n\n\n<p>Phone number: +2347015447949<\/p>\n\n\n\n<p>Or visit us at:<\/p>\n\n\n\n<p>  FlexceeTech  Limited,<\/p>\n\n\n\n<p>1st Floor, Leasing House, C &amp; I Leasing Drive,<\/p>\n\n\n\n<p>Off Bisola Durosinmi Etti Drive,&nbsp;Off Admiralty Way,<\/p>\n\n\n\n<p>Lekki Phase 1, Lagos, Nigeria<\/p>\n\n\n\n<p>You can also contact our Data Protection Officer @ <a href=\"mailto:info@seamfix.com\">info@seamfix.com<\/a>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>  FlexceeTech  Limited (“Seamfix”) respects your privacy rights and takes its data protection obligations very seriously. This Privacy Policy sets out [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"parent":0,"menu_order":6,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":""},"_links":{"self":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/pages\/31461"}],"collection":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/comments?post=31461"}],"version-history":[{"count":0,"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/pages\/31461\/revisions"}],"wp:attachment":[{"href":"https:\/\/nextgen.seamfix.com\/wp-json\/wp\/v2\/media?parent=31461"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}